// /**
//
// Copyright (c) 2010, Intel Corporation. All rights reserved.<BR>
// This program and the accompanying materials
// are licensed and made available under the terms and conditions of the BSD License
// which accompanies this distribution. The full text of the license may be found at
// http://opensource.org/licenses/bsd-license.php
//
// THE PROGRAM IS DISTRIBUTED UNDER THE BSD LICENSE ON AN "AS IS" BASIS,
// WITHOUT WARRANTIES OR REPRESENTATIONS OF ANY KIND, EITHER EXPRESS OR IMPLIED.
//
// Module Name:
//
// UefiShellInstall1CommandsLib.uni
//
// Abstract:
//
// String definitions for UEFI Shell 2.0 Install1 commands
//
//
// **/

/=#

#langdef   en-US "en-english"

#string STR_GEN_NO_MEM            #language en-US "%EError. %NMemory is not available.\r\n"
#string STR_GEN_PROBLEM           #language en-US "%EError. %NThe argument '%B%s%N' is invalid.\r\n"
#string STR_GEN_NO_DRIVER_BOOT    #language en-US "%EError. %NDriver or Boot must be selected.\r\n"
#string STR_GEN_TOO_FEW           #language en-US "%EError. %NToo few arguments specified.\r\n"
#string STR_GEN_TOO_MANY          #language en-US "%EError. %NToo many arguments specified.\r\n"
#string STR_GEN_FILE_OPEN_FAIL    #language en-US "%EError. %NThe file '%B%s%N' failed to open.\r\n"
#string STR_BCFG_WRITE_FAIL       #language en-US "%EError. %NFailed writing to '%B%s%N' (%r).\r\n"
#string STR_BCFG_READ_FAIL        #language en-US "%EError. %NFailed reading from '%B%s%N' (%r).\r\n"
#string STR_BCFG_HANDLE           #language en-US "%EError. %NThe handle [%H%02x%N] does not have DevicePath.\r\n"
#string STR_BCFG_FILE             #language en-US "%EError. %NThe file '%B%s%N' matches multiple files.\r\n"
#string STR_BCFG_FILE_OPEN        #language en-US "%EError. %NThe file '%B%s%N' failed to open: %r.\r\n"
#string STR_BCFG_FILE_DP          #language en-US "%EError. %NThe file '%B%s%N' could not convert to DevPath.\r\n"
#string STR_BCFG_TARGET_NF        #language en-US "%EError. %NCould not find unused target index.\r\n"
#string STR_BCFG_TARGET           #language en-US "%NTarget = %04x.\r\n"
#string STR_BCFG_SET_VAR_FAIL     #language en-US "%EError. %NFailed to set %s: %r.\r\n"

#string STR_BCFG_LOCATION_RANGE   #language en-US "%EError. %Ntarget location must be <= %d.\r\n"
#string STR_BCFG_LOAD_OPTIONS     #language en-US "%B%s   %d%N\r\n"
                                                  "  Desc    - %s\r\n"
                                                  "  DevPath - %s\r\n"
                                                  "  Optional- %c\r\n"

#string STR_GET_HELP_BCFG         #language en-US ""
".TH bcfg 0 "configure boot and driver"\r\n"
".SH NAME\r\n"
"Manages the boot and driver options that are stored in NVRAM.\r\n"
".SH SYNOPSIS\r\n"
"bcfg driver|boot [dump [-v]] [add # file "desc"] [addp # file "desc"][addh # handle "desc"] [rm #] [mv # #] [-opt # [[filename]|["data"]] | [KeyData <ScanCode UnicodeChar>]]\r\n"
".SH SYNOPSIS\r\n"
"driver       Display or modify the driver option list.\r\n"
"boot         Display or modify the boot option list.\r\n"
"dump         Display the option list.\r\n"
"-v           Display the option list with extra info including the optional data.\r\n"
"add          Add an option. The # is the number of options to add in hexadecimal. The file name of the UEFI application/driver for the option. The quoted parameter is the description of the option being added.\r\n"
"addh         Add an option that refers to the driver specified by handle. The # is the number of options to add, in hexadecimal. The handle is the driver handle, in hexadecimal. The device path for the option is retrieved from the handle. The quoted parameter is the description of the option being added.\r\n"
"addp         Add an option that refers to a specific file. Only the portion of the device path starting with the hard drive partition is placed in the option. The # is the number of options to add, in hexadecimal. The quoted parameter is the description of the option being added.\r\n"
"rm           Remove an option. The parameter lists the number of the options to remove in hexadecimal.\r\n"
"mv           Move an option. The first numeric parameter is the number of the option to move in hexadecimal. The second numeric parameter is the new number of the option being moved.\r\n"
"-opt         Display/modify the optional data associated with a driver or boot option. Followed either by the file name of the file which contains the binary data to be associated with the driver or boot option optional data or else the quotedelimited data which will be associated with the driver or boot option optional data.\r\n"
"KeyData      The packed value associated with a hot-key. This is the equivalent of the EFI_KEY_DATA value in the UEFI specification.\r\n"
"ScanCode     This is the UEFI-defined Scan code portion of the EFI_INPUT_KEY struction. This value is directly associated with the preceding KeyData value and there may be 1 to 4 entries per the UEFI specification. When one instance of this parameter has a non-zero value, the paired UnicodeChar value will have a zero-based value.\r\n"
"UnicodeChar  This is the Unicode value for the character associated with the preceding KeyData value. There may be 1 to 4 entries per the UEFI specification. When one instance of this parameter has a non-zero value, the paired ScanCode value will have a zero-based value.\r\n"
".SH DESCRIPTION\r\n"
"Manages the boot and driver options stored in NVRAM. This command can display the Boot#### or Driver#### environment variables by using the dump option. The add option can be used to add a new Boot#### or Driver#### environment variable. The rm option can be used to delete a Boot#### or Driver#### environment variable, and finally, then mv option can be used to reorder the Boot#### and Driver#### environment variables. The add, rm, and mv options also update the BootOrder or DriverOrder environment variables as appropriate.\r\n"
".SH EXAMPLES\r\n"
"To display driver options:\r\n"
"  %EShell>%N bcfg driver dump\r\n"
"To display boot options:\r\n"
"  %EShell>%N bcfg boot dump\r\n"
"To display verbosely of boot options:\r\n"
"  %EShell>%N bcfg boot dump -v\r\n"
"To add a driver option #5\r\n"
"  %EShell>%N bcfg driver add 5 mydriver.efi "My Driver"\r\n"
"To add a boot option #3\r\n"
"  %EShell>%N bcfg boot add 3 osloader.efi "My OS"\r\n"
"To remove boot option #3\r\n"
"  %EShell>%N bcfg boot rm 3\r\n"
"To move boot option #3 to boot option #7\r\n"
"  %EShell>%N bcfg boot mv 3 7\r\n"
"To assign a CTRL-B hot-key to boot option #3.\r\n"
"  %EShell>%N bcfg boot -opt 3 0x40000200 0 0x42\r\n"
".SH RETURNVALUES\r\n"
"SHELL_SUCCESS            The action was completed as requested.\r\n"
"SHELL_NOT_FOUND          The requested option was not found.\r\n"
"SHELL_INVALID_PARAMETER  One of the passed in parameters was incorrectly formatted or its value was out of bounds.\r\n"
"SHELL_UNSUPPORTED        The action as requested was unsupported.\r\n"
"SHELL_SECURITY_VIOLATION This function was not performed due to a security violation.\r\n"
"SHELL_OUT_OF_RESOURCES   There was insufficient free space for the request to be completed.\r\n"

